test_cases/2d/aero_10h_2d/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | SeedFOAM Hybrid 3D case generator
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    {
        name    buildingCells; type cellSet; action new;
        source  boxToCell; box (18.7296 7.1167 0)(19.0575 7.449 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (15.8848 4.315 0)(16.2035 4.8313 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (9.6844 6.6145 0)(10.0714 6.9699 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (24.4727 9.2185 0)(24.9099 9.6982 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (6.932 3.5581 0)(7.2495 3.8822 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (8.3645 11.6139 0)(8.8332 11.9513 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (5.7226 5.1031 0)(6.1934 5.6419 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (8.3034 10.8032 0)(8.8113 11.133 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (18.3208 2.7579 0)(18.9428 3.1359 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (7.3824 5.3039 0)(7.8756 5.6641 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (24.71 3.7722 0)(25.0481 4.2425 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (18.2695 11.7364 0)(18.6046 12.0411 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (9.2657 4.5207 0)(9.782 5.0415 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (15.5164 10.5757 0)(16.0598 11.0392 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (11.5501 5.2453 0)(12.3403 5.8007 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (20.3183 6.27 0)(21.0493 6.7521 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (19.9424 5.5234 0)(20.3302 5.9894 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (19.5426 7.4673 0)(20.3298 7.9922 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (8.6348 12.0647 0)(9.1265 12.5441 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (9.1184 3.4344 0)(9.5577 3.8708 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (16.5731 6.0452 0)(16.9471 6.4141 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (17.9853 2.529 0)(18.3093 2.9131 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (20.1431 3.2267 0)(20.8584 3.6088 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (22.7211 12.1332 0)(23.2231 12.5773 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (18.1891 12.4254 0)(18.7592 12.8545 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (11.4358 4.4904 0)(11.9391 4.9398 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (22.3036 8.4965 0)(22.7536 8.9877 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (13.0774 9.0983 0)(13.4291 9.4702 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (19.533 12.6765 0)(20.3103 13.1355 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (14.6621 12.2088 0)(15.0664 12.5613 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (17.897 7.878 0)(18.3489 8.252 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (19.8439 1.9225 0)(20.5531 2.4666 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (16.7916 3.8019 0)(17.2815 4.1281 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (4.5584 7.3051 0)(5.0936 7.7988 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (7.7382 9.655 0)(8.3394 10.1305 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (22.1286 4.9097 0)(22.7605 5.472 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (10.1619 2.5427 0)(10.7704 3.1088 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (16.2032 11.403 0)(16.949 11.9849 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (15.1394 3.3582 0)(15.6239 3.7978 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (12.574 12.2356 0)(13.057 12.6929 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (10.95 8.1301 0)(11.3808 8.5328 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (21.2259 3.6114 0)(21.7893 3.9807 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (13.4071 5.1222 0)(13.8651 5.4639 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (21.601 10.5519 0)(21.9672 10.9992 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (13.97 8.5986 0)(14.7075 9.1331 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (5.9892 5.6436 0)(6.4867 5.9474 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (23.6199 6.0084 0)(23.9722 6.4685 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (10.3174 10.9195 0)(10.9318 11.2826 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (17.1369 11.6143 0)(17.6416 12.1917 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (18.1296 7.1513 0)(18.5948 7.555 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (9.3313 9.2364 0)(9.8624 9.6149 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (23.0417 9.1353 0)(23.8205 9.7331 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (19.8113 2.6646 0)(20.2422 3.1892 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (9.7355 8.0733 0)(10.0379 8.6091 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (22.664 2.3249 0)(23.2423 2.8646 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (9.9672 6.1246 0)(10.7514 6.5578 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (11.8676 2.0254 0)(12.1763 2.5498 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (13.8847 11.1725 0)(14.3692 11.4868 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (20.9694 9.5139 0)(21.5319 10.0292 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (11.5116 8.3014 0)(11.9972 8.6554 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (4.5128 2.8509 0)(5.2799 3.2096 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (6.1924 12.1895 0)(6.8732 12.7518 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (22.2242 4.2625 0)(22.6359 4.6194 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (23.1625 1.5661 0)(23.7335 1.9778 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (10.301 8.9505 0)(10.7022 9.541 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (17.5958 6.9205 0)(17.9119 7.3737 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (12.7143 10.1917 0)(13.3571 10.582 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (4.9531 11.5877 0)(5.7072 12.0544 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (23.9514 12.2072 0)(24.3222 12.5764 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (18.2978 4.9653 0)(18.9275 5.3323 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (8.6787 9.9682 0)(9.2824 10.2967 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (18.1739 11.1937 0)(18.7187 11.5218 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (22.3517 12.6188 0)(23.1348 13.1476 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (7.2079 1.8127 0)(7.7207 2.1855 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (10.9969 8.6505 0)(11.4097 8.9704 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (24.4878 2.4472 0)(24.8017 2.7621 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (4.6009 12.2803 0)(4.9361 12.6733 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (12.5451 7.5637 0)(13.2383 7.9983 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (13.4023 10.7339 0)(13.8302 11.1199 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (5.8471 7.1692 0)(6.6207 7.5582 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (20.9087 8.8709 0)(21.4253 9.3768 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (16.3391 7.0654 0)(16.6928 7.5479 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (11.2241 4.0861 0)(11.7492 4.4747 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (13.2839 1.6824 0)(13.6579 2.0313 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (7.5349 9.302 0)(7.8881 9.6327 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (20.8608 4.068 0)(21.5654 4.5513 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (13.4066 5.477 0)(13.9856 5.8057 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (8.2908 7.463 0)(8.6481 8.0146 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (24.132 7.3172 0)(24.8591 7.9114 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (23.987 4.5741 0)(24.3077 5.0035 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (20.578 5.7188 0)(21.2781 6.1125 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (22.4713 6.4358 0)(23.2023 7.0334 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (11.8364 3.2922 0)(12.1471 3.8262 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (12.4539 11.5062 0)(12.855 11.8945 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (8.9309 7.0994 0)(9.5214 7.6279 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (6.3545 9.6922 0)(6.7858 10.0802 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (7.4711 6.1381 0)(7.8008 6.5494 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (13.9217 6.5502 0)(14.2817 7.0727 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (21.5645 9.4196 0)(21.9689 9.8359 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (13.1509 3.4758 0)(13.5204 3.886 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (19.9101 10.6015 0)(20.6384 11.1362 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (22.5993 9.368 0)(22.9298 9.8792 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (7.3985 10.6166 0)(8.1559 10.9452 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (12.5014 4.6373 0)(13.2606 5.1791 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (23.7733 10.8639 0)(24.3439 11.1871 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (23.4428 11.6111 0)(23.8785 11.9576 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (11.2672 1.6292 0)(11.6881 2.1585 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (15.233 9.5227 0)(15.8387 10.0282 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (20.8538 2.187 0)(21.5748 2.5079 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (21.6835 12.6712 0)(22.111 13.0686 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (8.7552 5.9335 0)(9.2359 6.457 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (11.0473 7.3663 0)(11.5225 7.7831 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (10.4487 9.8084 0)(10.7599 10.3108 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (11.5268 6.468 0)(11.8414 6.8707 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (20.5492 10.2132 0)(21.0051 10.57 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (7.4694 11.0349 0)(7.8793 11.5466 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (12.225 10.6021 0)(12.589 11.1982 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (12.7682 2.8457 0)(13.391 3.2098 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (14.5646 1.4959 0)(15.2052 1.9229 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (17.6053 5.9304 0)(18.346 6.3242 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (8.0416 3.796 0)(8.5148 4.1701 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (22.7999 7.5541 0)(23.4803 7.9405 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (14.5076 5.906 0)(15.0589 6.2406 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (18.1378 3.8031 0)(18.9084 4.1145 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (19.0595 9.0041 0)(19.4407 9.5258 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (21.8761 11.2198 0)(22.5192 11.6248 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (14.3625 7.7055 0)(14.9744 8.1337 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (22.6502 7.9562 0)(23.4293 8.2786 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (14.4479 3.7484 0)(15.0377 4.2825 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (21.2891 2.7041 0)(22.0493 3.0469 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (16.4327 12.3354 0)(16.8452 12.8828 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (17.1474 2.7553 0)(17.905 3.0888 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (8.7396 11.1815 0)(9.2415 11.5946 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (12.0911 4.1766 0)(12.4205 4.5876 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (18.3545 6.2 0)(18.8077 6.5341 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (14.0837 4.4844 0)(14.8411 5.0789 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (14.0631 2.7468 0)(14.4308 3.2288 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (5.9921 11.3299 0)(6.6751 11.865 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (13.0177 8.1222 0)(13.5193 8.7079 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (17.2726 9.1142 0)(17.6549 9.5966 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (6.2871 8.5967 0)(6.8471 8.9322 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (20.397 9.49 0)(20.9321 9.9119 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (18.8943 9.7979 0)(19.3189 10.2944 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (4.8818 1.5209 0)(5.6663 1.9216 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (14.49 2.9323 0)(14.8449 3.3723 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (22.5388 2.9687 0)(22.9837 3.4479 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (17.0974 4.9523 0)(17.4254 5.3564 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (17.4027 1.5778 0)(17.7761 2.1753 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (24.3298 4.8273 0)(24.6389 5.3249 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (11.296 11.1185 0)(11.7616 11.5678 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (18.6973 7.7225 0)(19.0465 8.2299 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (7.3503 4.8077 0)(7.7806 5.2663 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (23.0271 10.1456 0)(23.3879 10.5477 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (23.7152 3.865 0)(24.3835 4.4224 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (23.2788 2.6228 0)(23.9302 2.9789 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (19.9716 8.6161 0)(20.6152 9.0274 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (20.9938 10.9521 0)(21.5844 11.4621 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (19.6932 10.0284 0)(20.0364 10.4355 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (22.2031 3.6096 0)(22.7479 4.0629 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (13.3923 2.6441 0)(13.7852 3.1272 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (20.4182 11.4118 0)(20.7866 11.8919 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (5.3788 7.993 0)(6.0215 8.2945 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (20.4692 12.5343 0)(20.7831 13.1132 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (8.6917 1.9632 0)(9.4749 2.4845 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (4.5752 8.1812 0)(5.135 8.5571 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (4.8005 10.4138 0)(5.1281 10.9199 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (18.1866 9.4853 0)(18.6276 9.7931 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (15.2522 6.5117 0)(15.7369 7.0721 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (23.3405 10.8727 0)(23.6575 11.1745 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (9.57 10.6051 0)(10.2828 11.0975 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (10.7656 6.544 0)(11.0816 6.8788 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (5.3405 10.0606 0)(6.1359 10.6042 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (7.5177 7.0298 0)(8.0266 7.4565 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (11.4952 9.3289 0)(12.053 9.8796 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (12.2894 1.7112 0)(12.7583 2.2231 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (14.4833 11.1034 0)(15.1363 11.4678 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (16.0833 10.3324 0)(16.8191 10.902 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (11.6509 11.6272 0)(12.2733 11.9712 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (5.3927 1.9932 0)(6.1822 2.391 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (14.7698 12.8725 0)(15.3506 13.2441 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (10.0547 4.0154 0)(10.6516 4.5876 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (21.3637 6.53 0)(21.7996 6.9777 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (16.2423 11.0388 0)(16.7605 11.3683 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (10.8508 4.3945 0)(11.163 4.8833 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (19.5694 8.1514 0)(19.8794 8.5866 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (15.7098 5.6407 0)(16.4633 6.031 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (8.117 8.9799 0)(8.6634 9.3145 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (23.4873 8.5181 0)(24.1003 8.9426 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (15.7793 8.89 0)(16.1302 9.3702 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (24.7399 5.5651 0)(25.1342 5.9298 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (22.2379 10.7364 0)(22.727 11.2056 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (20.7304 4.938 0)(21.3709 5.4417 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (10.2277 11.8215 0)(10.9948 12.3143 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (9.8827 5.0674 0)(10.417 5.4261 0.4);
    }
    {
        name    buildingCells; type cellSet; action add;
        source  boxToCell; box (9.8343 7.4265 0)(10.6287 8.0202 0.4);
    }
    {
        name    fluid; type cellSet; action new;
        source  cellToCell; set buildingCells;
    }
    {
        name    fluid; type cellSet; action invert;
    }
);

// ************************************************************************* //
